; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite6 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	infrared3 - mode
	image0 - mode
	spectrograph2 - mode
	image4 - mode
	thermograph5 - mode
	spectrograph1 - mode
	star14 - direction
	groundstation11 - direction
	groundstation12 - direction
	groundstation8 - direction
	groundstation4 - direction
	groundstation1 - direction
	groundstation0 - direction
	star2 - direction
	groundstation17 - direction
	star5 - direction
	groundstation10 - direction
	star15 - direction
	star9 - direction
	star7 - direction
	star6 - direction
	star13 - direction
	groundstation3 - direction
	star16 - direction
	star18 - direction
	planet19 - direction
	planet20 - direction
	star21 - direction
	phenomenon22 - direction
	phenomenon23 - direction
	planet24 - direction
	star25 - direction
	star26 - direction
	star27 - direction
	planet28 - direction
	star29 - direction
	star30 - direction
	phenomenon31 - direction
	planet32 - direction
	star33 - direction
	planet34 - direction
	star35 - direction
	star36 - direction
	star37 - direction
	planet38 - direction
	star39 - direction
	planet40 - direction
	phenomenon41 - direction
	planet42 - direction
	planet43 - direction
	star44 - direction
	phenomenon45 - direction
)
(:init
	(supports instrument0 thermograph5)
	(supports instrument0 image0)
	(calibration_target instrument0 groundstation4)
	(calibration_target instrument0 groundstation1)
	(calibration_target instrument0 groundstation10)
	(calibration_target instrument0 star2)
	(calibration_target instrument0 groundstation17)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet40)
	(supports instrument1 infrared3)
	(supports instrument1 image4)
	(calibration_target instrument1 groundstation11)
	(calibration_target instrument1 star6)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 groundstation10)
	(calibration_target instrument2 groundstation8)
	(calibration_target instrument2 star15)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph5)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 groundstation17)
	(calibration_target instrument3 groundstation3)
	(calibration_target instrument3 star16)
	(supports instrument4 infrared3)
	(supports instrument4 image0)
	(calibration_target instrument4 groundstation12)
	(calibration_target instrument4 groundstation17)
	(calibration_target instrument4 groundstation10)
	(calibration_target instrument4 groundstation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 groundstation10)
	(supports instrument5 image4)
	(supports instrument5 image0)
	(calibration_target instrument5 star2)
	(calibration_target instrument5 star7)
	(calibration_target instrument5 star14)
	(calibration_target instrument5 star15)
	(calibration_target instrument5 star16)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 groundstation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 star30)
	(supports instrument7 infrared3)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph5)
	(calibration_target instrument7 groundstation10)
	(calibration_target instrument7 groundstation1)
	(calibration_target instrument7 groundstation3)
	(calibration_target instrument7 star6)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 star7)
	(calibration_target instrument8 groundstation4)
	(calibration_target instrument8 groundstation3)
	(calibration_target instrument8 star2)
	(calibration_target instrument8 star15)
	(calibration_target instrument8 star5)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 planet28)
	(supports instrument9 spectrograph1)
	(supports instrument9 spectrograph2)
	(supports instrument9 image4)
	(calibration_target instrument9 groundstation0)
	(calibration_target instrument9 groundstation4)
	(calibration_target instrument9 groundstation11)
	(calibration_target instrument9 star6)
	(supports instrument10 infrared3)
	(calibration_target instrument10 star7)
	(calibration_target instrument10 star14)
	(calibration_target instrument10 groundstation8)
	(supports instrument11 spectrograph2)
	(supports instrument11 image0)
	(supports instrument11 infrared3)
	(calibration_target instrument11 groundstation11)
	(calibration_target instrument11 star16)
	(supports instrument12 infrared3)
	(calibration_target instrument12 groundstation3)
	(calibration_target instrument12 groundstation12)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 star44)
	(supports instrument13 image0)
	(calibration_target instrument13 star2)
	(calibration_target instrument13 star14)
	(supports instrument14 spectrograph2)
	(supports instrument14 thermograph5)
	(supports instrument14 image4)
	(calibration_target instrument14 groundstation4)
	(calibration_target instrument14 groundstation12)
	(calibration_target instrument14 groundstation11)
	(calibration_target instrument14 groundstation8)
	(supports instrument15 image0)
	(supports instrument15 spectrograph2)
	(calibration_target instrument15 groundstation8)
	(calibration_target instrument15 groundstation17)
	(calibration_target instrument15 star15)
	(calibration_target instrument15 star13)
	(calibration_target instrument15 star2)
	(calibration_target instrument15 star7)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(on_board instrument15 satellite5)
	(power_avail satellite5)
	(pointing satellite5 phenomenon22)
	(supports instrument16 thermograph5)
	(calibration_target instrument16 groundstation17)
	(calibration_target instrument16 groundstation4)
	(supports instrument17 image0)
	(calibration_target instrument17 groundstation17)
	(calibration_target instrument17 star2)
	(calibration_target instrument17 groundstation0)
	(calibration_target instrument17 groundstation1)
	(supports instrument18 thermograph5)
	(supports instrument18 image4)
	(supports instrument18 spectrograph2)
	(calibration_target instrument18 groundstation3)
	(calibration_target instrument18 star9)
	(calibration_target instrument18 star15)
	(calibration_target instrument18 groundstation10)
	(calibration_target instrument18 star5)
	(calibration_target instrument18 star7)
	(supports instrument19 spectrograph1)
	(calibration_target instrument19 star16)
	(calibration_target instrument19 groundstation3)
	(calibration_target instrument19 star13)
	(calibration_target instrument19 star6)
	(calibration_target instrument19 star7)
	(on_board instrument16 satellite6)
	(on_board instrument17 satellite6)
	(on_board instrument18 satellite6)
	(on_board instrument19 satellite6)
	(power_avail satellite6)
	(pointing satellite6 star7)
)
(:goal (and
	(pointing satellite1 star9)
	(pointing satellite4 planet34)
	(have_image star18 thermograph5)
	(have_image planet19 image4)
	(have_image planet19 thermograph5)
	(have_image planet20 image4)
	(have_image star21 image0)
	(have_image star21 spectrograph2)
	(have_image phenomenon22 infrared3)
	(have_image phenomenon23 spectrograph2)
	(have_image phenomenon23 image4)
	(have_image star25 spectrograph2)
	(have_image star26 image0)
	(have_image star27 image0)
	(have_image planet28 thermograph5)
	(have_image planet28 spectrograph2)
	(have_image star29 image0)
	(have_image star30 spectrograph2)
	(have_image star30 thermograph5)
	(have_image planet32 image0)
	(have_image star33 spectrograph2)
	(have_image star33 thermograph5)
	(have_image planet34 infrared3)
	(have_image planet34 image0)
	(have_image star35 image4)
	(have_image star35 spectrograph1)
	(have_image star37 thermograph5)
	(have_image planet38 thermograph5)
	(have_image planet38 image0)
	(have_image planet40 infrared3)
	(have_image planet40 spectrograph2)
	(have_image phenomenon41 thermograph5)
	(have_image phenomenon41 spectrograph2)
	(have_image planet42 infrared3)
	(have_image planet42 image4)
	(have_image planet43 spectrograph1)
	(have_image planet43 spectrograph2)
	(have_image star44 infrared3)
	(have_image phenomenon45 image0)
))
(:metric minimize (total-time))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 39
2. (turn_to satellite4 planet34 star44)
   deleted: (pointing satellite4 star44)
   added: (pointing satellite4 planet34)
   goals met: 1 of 39
3. (switch_on instrument18 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument18)
   goals met: 1 of 39
4. (calibrate satellite1 instrument4 groundstation10)
   added: (calibrated instrument4)
   goals met: 1 of 39
5. (turn_to satellite1 star9 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 star9)
   goals met: 2 of 39
6. (calibrate satellite6 instrument18 star7)
   added: (calibrated instrument18)
   goals met: 2 of 39
7. (turn_to satellite6 phenomenon23 star7)
   deleted: (pointing satellite6 star7)
   added: (pointing satellite6 phenomenon23)
   goals met: 2 of 39
8. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 2 of 39
9. (turn_to satellite2 groundstation0 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 groundstation0)
   goals met: 2 of 39
10. (take_image satellite6 phenomenon23 instrument18 image4)
   added: (have_image phenomenon23 image4)
   goals met: 3 of 39
11. (turn_to satellite1 phenomenon22 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon22)
   goals met: 2 of 39
12. (take_image satellite6 phenomenon23 instrument18 spectrograph2)
   added: (have_image phenomenon23 spectrograph2)
   goals met: 3 of 39
13. (calibrate satellite2 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 3 of 39
14. (turn_to satellite2 planet43 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet43)
   goals met: 3 of 39
15. (take_image satellite1 phenomenon22 instrument4 infrared3)
   added: (have_image phenomenon22 infrared3)
   goals met: 4 of 39
16. (take_image satellite2 planet43 instrument6 spectrograph1)
   added: (have_image planet43 spectrograph1)
   goals met: 5 of 39
17. (turn_to satellite6 phenomenon41 phenomenon23)
   deleted: (pointing satellite6 phenomenon23)
   added: (pointing satellite6 phenomenon41)
   goals met: 5 of 39
18. (turn_to satellite1 star9 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 star9)
   goals met: 6 of 39
19. (take_image satellite6 phenomenon41 instrument18 spectrograph2)
   added: (have_image phenomenon41 spectrograph2)
   goals met: 7 of 39
20. (take_image satellite6 phenomenon41 instrument18 thermograph5)
   added: (have_image phenomenon41 thermograph5)
   goals met: 8 of 39
21. (turn_to satellite2 star35 planet43)
   deleted: (pointing satellite2 planet43)
   added: (pointing satellite2 star35)
   goals met: 8 of 39
22. (turn_to satellite1 planet34 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet34)
   goals met: 7 of 39
23. (take_image satellite2 star35 instrument6 spectrograph1)
   added: (have_image star35 spectrograph1)
   goals met: 8 of 39
24. (turn_to satellite6 planet19 phenomenon41)
   deleted: (pointing satellite6 phenomenon41)
   added: (pointing satellite6 planet19)
   goals met: 8 of 39
25. (take_image satellite1 planet34 instrument4 image0)
   added: (have_image planet34 image0)
   goals met: 9 of 39
26. (take_image satellite1 planet34 instrument4 infrared3)
   added: (have_image planet34 infrared3)
   goals met: 10 of 39
27. (take_image satellite6 planet19 instrument18 image4)
   added: (have_image planet19 image4)
   goals met: 11 of 39
28. (take_image satellite6 planet19 instrument18 thermograph5)
   added: (have_image planet19 thermograph5)
   goals met: 12 of 39
29. (turn_to satellite1 star9 planet34)
   deleted: (pointing satellite1 planet34)
   added: (pointing satellite1 star9)
   goals met: 13 of 39
30. (turn_to satellite6 planet20 planet19)
   deleted: (pointing satellite6 planet19)
   added: (pointing satellite6 planet20)
   goals met: 13 of 39
31. (take_image satellite6 planet20 instrument18 image4)
   added: (have_image planet20 image4)
   goals met: 14 of 39
32. (turn_to satellite1 phenomenon45 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon45)
   goals met: 13 of 39
33. (take_image satellite1 phenomenon45 instrument4 image0)
   added: (have_image phenomenon45 image0)
   goals met: 14 of 39
34. (turn_to satellite6 planet28 planet20)
   deleted: (pointing satellite6 planet20)
   added: (pointing satellite6 planet28)
   goals met: 14 of 39
35. (turn_to satellite1 star9 phenomenon45)
   deleted: (pointing satellite1 phenomenon45)
   added: (pointing satellite1 star9)
   goals met: 15 of 39
36. (take_image satellite6 planet28 instrument18 spectrograph2)
   added: (have_image planet28 spectrograph2)
   goals met: 16 of 39
37. (take_image satellite6 planet28 instrument18 thermograph5)
   added: (have_image planet28 thermograph5)
   goals met: 17 of 39
38. (turn_to satellite6 planet38 planet28)
   deleted: (pointing satellite6 planet28)
   added: (pointing satellite6 planet38)
   goals met: 17 of 39
39. (turn_to satellite6 star30 planet38)
   deleted: (pointing satellite6 planet38)
   added: (pointing satellite6 star30)
   goals met: 17 of 39
40. (turn_to satellite1 star44 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star44)
   goals met: 16 of 39
41. (take_image satellite6 star30 instrument18 spectrograph2)
   added: (have_image star30 spectrograph2)
   goals met: 17 of 39
42. (turn_to satellite1 star9 star44)
   deleted: (pointing satellite1 star44)
   added: (pointing satellite1 star9)
   goals met: 18 of 39
43. (take_image satellite6 star30 instrument18 thermograph5)
   added: (have_image star30 thermograph5)
   goals met: 19 of 39
44. (turn_to satellite6 star21 star30)
   deleted: (pointing satellite6 star30)
   added: (pointing satellite6 star21)
   goals met: 19 of 39
45. (turn_to satellite1 star26 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star26)
   goals met: 18 of 39
46. (take_image satellite6 star21 instrument18 spectrograph2)
   added: (have_image star21 spectrograph2)
   goals met: 19 of 39
47. (turn_to satellite1 planet32 star26)
   deleted: (pointing satellite1 star26)
   added: (pointing satellite1 planet32)
   goals met: 19 of 39
48. (take_image satellite1 planet32 instrument4 image0)
   added: (have_image planet32 image0)
   goals met: 20 of 39
49. (turn_to satellite6 planet38 star21)
   deleted: (pointing satellite6 star21)
   added: (pointing satellite6 planet38)
   goals met: 20 of 39
50. (turn_to satellite1 star9 planet32)
   deleted: (pointing satellite1 planet32)
   added: (pointing satellite1 star9)
   goals met: 21 of 39
51. (take_image satellite6 planet38 instrument18 thermograph5)
   added: (have_image planet38 thermograph5)
   goals met: 22 of 39
52. (turn_to satellite6 planet40 planet38)
   deleted: (pointing satellite6 planet38)
   added: (pointing satellite6 planet40)
   goals met: 22 of 39
53. (turn_to satellite1 planet40 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet40)
   goals met: 21 of 39
54. (turn_to satellite6 star33 planet40)
   deleted: (pointing satellite6 planet40)
   added: (pointing satellite6 star33)
   goals met: 21 of 39
55. (take_image satellite1 planet40 instrument4 infrared3)
   added: (have_image planet40 infrared3)
   goals met: 22 of 39
56. (take_image satellite6 star33 instrument18 spectrograph2)
   added: (have_image star33 spectrograph2)
   goals met: 23 of 39
57. (take_image satellite6 star33 instrument18 thermograph5)
   added: (have_image star33 thermograph5)
   goals met: 24 of 39
58. (turn_to satellite1 star9 planet40)
   deleted: (pointing satellite1 planet40)
   added: (pointing satellite1 star9)
   goals met: 25 of 39
59. (turn_to satellite6 planet40 star33)
   deleted: (pointing satellite6 star33)
   added: (pointing satellite6 planet40)
   goals met: 25 of 39
60. (turn_to satellite1 star44 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star44)
   goals met: 24 of 39
61. (take_image satellite1 star44 instrument4 infrared3)
   added: (have_image star44 infrared3)
   goals met: 25 of 39
62. (take_image satellite6 planet40 instrument18 spectrograph2)
   added: (have_image planet40 spectrograph2)
   goals met: 26 of 39
63. (turn_to satellite1 star9 star44)
   deleted: (pointing satellite1 star44)
   added: (pointing satellite1 star9)
   goals met: 27 of 39
64. (turn_to satellite6 planet42 planet40)
   deleted: (pointing satellite6 planet40)
   added: (pointing satellite6 planet42)
   goals met: 27 of 39
65. (take_image satellite6 planet42 instrument18 image4)
   added: (have_image planet42 image4)
   goals met: 28 of 39
66. (turn_to satellite1 planet38 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet38)
   goals met: 27 of 39
67. (take_image satellite1 planet38 instrument4 image0)
   added: (have_image planet38 image0)
   goals met: 28 of 39
68. (turn_to satellite6 planet43 planet42)
   deleted: (pointing satellite6 planet42)
   added: (pointing satellite6 planet43)
   goals met: 28 of 39
69. (turn_to satellite1 star9 planet38)
   deleted: (pointing satellite1 planet38)
   added: (pointing satellite1 star9)
   goals met: 29 of 39
70. (take_image satellite6 planet43 instrument18 spectrograph2)
   added: (have_image planet43 spectrograph2)
   goals met: 30 of 39
71. (turn_to satellite6 star25 planet43)
   deleted: (pointing satellite6 planet43)
   added: (pointing satellite6 star25)
   goals met: 30 of 39
72. (turn_to satellite1 star26 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star26)
   goals met: 29 of 39
73. (take_image satellite1 star26 instrument4 image0)
   added: (have_image star26 image0)
   goals met: 30 of 39
74. (turn_to satellite6 star18 star25)
   deleted: (pointing satellite6 star25)
   added: (pointing satellite6 star18)
   goals met: 30 of 39
75. (take_image satellite6 star18 instrument18 thermograph5)
   added: (have_image star18 thermograph5)
   goals met: 31 of 39
76. (turn_to satellite1 star9 star26)
   deleted: (pointing satellite1 star26)
   added: (pointing satellite1 star9)
   goals met: 32 of 39
77. (turn_to satellite6 star25 star18)
   deleted: (pointing satellite6 star18)
   added: (pointing satellite6 star25)
   goals met: 32 of 39
78. (turn_to satellite1 star29 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star29)
   goals met: 31 of 39
79. (take_image satellite6 star25 instrument18 spectrograph2)
   added: (have_image star25 spectrograph2)
   goals met: 32 of 39
80. (turn_to satellite1 planet42 star29)
   deleted: (pointing satellite1 star29)
   added: (pointing satellite1 planet42)
   goals met: 32 of 39
81. (take_image satellite1 planet42 instrument4 infrared3)
   added: (have_image planet42 infrared3)
   goals met: 33 of 39
82. (turn_to satellite6 star35 star25)
   deleted: (pointing satellite6 star25)
   added: (pointing satellite6 star35)
   goals met: 33 of 39
83. (turn_to satellite1 star21 planet42)
   deleted: (pointing satellite1 planet42)
   added: (pointing satellite1 star21)
   goals met: 33 of 39
84. (take_image satellite6 star35 instrument18 image4)
   added: (have_image star35 image4)
   goals met: 34 of 39
85. (take_image satellite1 star21 instrument4 image0)
   added: (have_image star21 image0)
   goals met: 35 of 39
86. (turn_to satellite6 star37 star35)
   deleted: (pointing satellite6 star35)
   added: (pointing satellite6 star37)
   goals met: 35 of 39
87. (turn_to satellite1 star27 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 star27)
   goals met: 35 of 39
88. (take_image satellite6 star37 instrument18 thermograph5)
   added: (have_image star37 thermograph5)
   goals met: 36 of 39
89. (take_image satellite1 star27 instrument4 image0)
   added: (have_image star27 image0)
   goals met: 37 of 39
90. (turn_to satellite1 star29 star27)
   deleted: (pointing satellite1 star27)
   added: (pointing satellite1 star29)
   goals met: 37 of 39
91. (take_image satellite1 star29 instrument4 image0)
   added: (have_image star29 image0)
   goals met: 38 of 39
92. (turn_to satellite1 star9 star29)
   deleted: (pointing satellite1 star29)
   added: (pointing satellite1 star9)
   goals met: 39 of 39
